{"awesomeSheet":{"awesome":true,"version":5.7},"basics":{"character":{"name":"Slinky Sharpshiv","race":"Goblin","alignment":"Neutral","deity":"","height":"2ft11in","weight":"33","age":"15","gender":"Male","hero_points":"","description":"","size":{"category":"Small","modifier":{"base":1,"special":-1,"fly":2,"stealth":4}}},"classes":{"all":[{"level":5,"hp":{"base":27,"favoured":"","current":27},"ranks":{"base":8,"favoured":"","current":8},"bab":3,"name":"Unchained Ninja","saves":{"fortitude":1,"reflex":4,"will":1}}],"string":"Unchained Ninja 5"},"experience":{"level":{"current":5,"class_total":5},"next_level":23000,"needed":8000,"total":15000,"advancement":"Medium"},"initiative":{"misc":"","temp":"","feat":"","trait":"","current":6,"bonuses":{"str":false,"dex":true,"con":false,"int":false,"wis":false,"cha":false,"level":false,"half_level":false}},"speed":{"land":"30","fly":"","maneuverability":"","swim":"","climb":"","burrow":""},"image":{"uploaded":false,"background":"","color":{"r":"","g":"","b":""},"data":"","orientation":"","position":{"x":"","y":""},"size":{"width":"","height":""},"scale":""},"senses":{"racial":"Darkvision 60ft","magical":""}},"statistics":{"stats":{"str":{"modifier":-1,"base":10,"enhancement":"","misc":"","racial":-2,"temp":"","current":8},"dex":{"modifier":6,"base":18,"enhancement":"","misc":"","racial":4,"temp":"","current":22},"con":{"modifier":1,"base":12,"enhancement":"","misc":"","racial":"","temp":"","current":12},"int":{"modifier":1,"base":12,"enhancement":"","misc":"","racial":"","temp":"","current":12},"wis":{"modifier":-1,"base":8,"enhancement":"","misc":"","racial":"","temp":"","current":8},"cha":{"modifier":0,"base":12,"enhancement":"","misc":"","racial":-2,"temp":"","current":10}},"abilities":{"all":[],"notes":""},"power":{"all":[]},"feats":{"all":[{"name":"Roll With It","note":"","index":1107},{"name":"no trace","note":"At 3rd level, a ninja learns to cover her tracks, remain hidden, and conceal her presence. The DC to track a ninja using the Survival skill increases by +1. In addition, her training gives her a +1 insight bonus on Disguise skill checks and on opposed Stealth checks whenever she is stationary and does not take any action for at least 1 round. Every three levels thereafter, the increase to Survival DCs and the bonuses on Disguise and opposed Stealth checks increase by 1.","index":false},{"name":"uncanny dodge","note":"At 4th level, a rogue can react to danger before her senses would normally allow her to do so. She cannot be caught flat-footed, nor does she lose her Dexterity bonus to AC if the attacker is invisible. She still loses her Dexterity bonus to AC if immobilized. A rogue with this ability can still lose her Dexterity bonus to AC if an opponent successfully uses the feint action against her.<br><br>If a rogue already has uncanny dodge from a different class, she automatically gains improved uncanny dodge (see below) instead.","index":false},{"name":"sneak attack (1d6 + 1d6 * lvl/2)","note":"If a rogue can catch an opponent when he is unable to defend himself effectively from her attack, she can strike a vital spot for extra damage.<br><div><br></div>The rogue’s attack deals extra damage anytime her target would be denied a Dexterity bonus to AC (whether the target actually has a Dexterity bonus or not), or when the rogue flanks her target. This extra damage is 1d6 at 1st level, and increases by 1d6 every 2 rogue levels thereafter. Ranged attacks can count as sneak attacks only if the target is within 30 feet. This additional damage is precision damage and is not multiplied on a critical hit.<br><br>With a weapon that deals nonlethal damage (such as a sap, unarmed strike, or whip), a rogue can make a sneak attack that deals nonlethal damage instead of lethal damage. She cannot use a weapon that deals lethal damage to deal nonlethal damage in a sneak attack—not even with the usual –4 penalty.<br><br>The rogue must be able to see the target well enough to pick out a vital spot and must be able to reach such a spot. A rogue cannot sneak attack while striking a creature with total concealment.","index":false},{"name":"finesse training","note":"At 1st level, a rogue gains Weapon Finesse as a bonus feat. In addition, starting at 3rd level, she can select any one type of weapon that can be used with Weapon Finesse (such as rapiers or daggers). Once this choice is made, it cannot be changed. Whenever she makes a successful melee attack with the selected weapon, she adds her Dexterity modifier instead of her Strength modifier to the damage roll. If any effect would prevent the rogue from adding her Strength modifier to the damage roll, she does not add her Dexterity modifier. The rogue can select a second weapon at 11th level and a third at 19th level.","index":false},{"name":"ki pool (lvl/2 + ch mod)","note":"At 2nd level, a ninja gains a pool of ki points, supernatural energy she can use to accomplish amazing feats. The number of points in the ninja’s ki pool is equal to 1/2 her ninja level + her Charisma modifier. As long as she has at least 1 point in her ki pool, she treats any Acrobatics skill check made to jump as if she had a running start. At 10th level, she also reduces the DC of Acrobatics skill checks made to jump by 1/2 (although she still cannot move farther than her speed allows).<br><br>By spending 1 point from her ki pool, a ninja can make one additional attack at her highest attack bonus, but she can do so only when making a full attack. In addition, she can spend 1 point to increase her speed by 20 feet for 1 round. Finally, a ninja can spend 1 point from her ki pool to give herself a +4 insight bonus on Stealth checks for 1 round. Each of these powers is activated as a swift action. A ninja can gain additional powers that consume points from her ki pool by selecting certain ninja tricks.<br><br>The ki pool is replenished each morning after 8 hours of rest or meditation; these hours do not need to be consecutive. If the ninja possesses levels in another class that grants points to a ki pool, ninja levels stack with the levels of that class to determine the total number of ki points in the combined pool, but only one ability score modifier is added to the total. The choice of which score to use is made when the second class ability is gained, and once made, the choice is set. The ninja can now use ki points from this pool to power the abilities of every class she possesses that grants a ki pool.","index":false},{"name":"ninja skill ","note":"As a ninja continues her training, she learns a number of tricks that allow her to confuse her foes and grant her supernatural abilities. Starting at 2nd level, a ninja gains one ninja trick. She gains one additional ninja trick for every 2 levels attained after 2nd. Unless otherwise noted, a ninja cannot select an individual ninja trick more than once.<br><br>Tricks marked with an asterisk (*) add effects to a ninja’s sneak attack. Only one of these tricks can be applied to an individual attack and the decision must be made before the attack is made.<br><br>A complete listing of ninja tricks can be found here: Ninja Tricks","index":false},{"name":"Weapon Finesse","note":"","index":1448},{"name":"Two-Weapon Fighting","note":"","index":1396},{"name":"poison use","note":"At 1st level, a ninja is trained in the use of poison and cannot accidentally poison herself when applying poison to a weapon.","index":false},{"name":"Style Strike","note":"<div>At 5th level, a ninja can learn one type of style strike, as the monk class feature. Whenever she spends ki from her ki pool to make an additional attack, she can designate that additional attack as a style strike, regardless of the weapon she uses to make the attack. The attack is resolved as normal, but it has a different effect depending upon the type of strike chosen. At 10th level and every 5 levels thereafter, a ninja learns an additional style strike. She must choose which style strike to apply before the attack roll is made. Unlike a monk, a ninja does not gain the ability to designate more than one attack as a style strike per round.</div><div><br></div><div>Defensive Spin: The monk spins about, confounding his foe. If the attack hits, the monk gains a +4 dodge bonus to AC against any attacks made by the target of the style strike until the start of his next turn. This bonus does not stack with itself. The monk must attack with a fist to use this style strike.</div><br>Elbow Smash: The monk follows up a punch with a strike from his elbow. If the attack hits, the monk can make an additional attack using the same attack bonus as the punch at a –5 penalty. If this second attack hits, it deals damage as normal, but all of the damage is nonlethal. The monk must attack with a fist to use this style strike.<br><br>Flying Kick: The monk leaps through the air to strike a foe with a kick. Before the attack, the monk can move a distance equal to his fast movement bonus. This movement is made as part of the monk’s flurry of blows attack and does not require an additional action. At the end of this movement, the monk must make an attack against an adjacent foe. This movement may be between attacks. This movement provokes an attack of opportunity as normal. The attack made after the movement must be a kick.<br><br>Foot Stomp: The monk stomps on a foe’s foot, preventing the opponent from escaping. If the attack hits and the monk ends his turn adjacent to that foe, the foe’s movement is restricted. Until the start of the monk’s next turn, the target of this attack can move only in such a way that the space it occupies is adjacent to the monk. Alternatively, it can attempt a combat maneuver check (against the monk’s CMD) as a standard action to break free. This strike does not work against foes that cannot be tripped. The monk must attack with a kick to use this style strike.<br><br>Hammerblow: The monk links his hands together, swinging both arms like a club and dealing tremendous damage. If the attack hits, the monk rolls his unarmed strike damage twice, adding both rolls together before applying Strength and other modifiers to the damage. This bonus damage is not multiplied on a critical hit. The monk must attack with a fist to use this style strike, but must have both hands free.<br><br>Head-Butt: The monk slams his head into his enemy’s head, leaving his foe reeling. If the attack hits and the foe is of the same size or one size smaller than the monk, the monk can make a free combat maneuver check against the target of this strike (using the base attack bonus of the attack used to hit the foe). If the foe is not of the same creature type as the monk, the monk takes a –8 penalty on this check. If the check is successful, the target is staggered for 1 round. Creatures without a discernible head are not affected by this style strike (subject to GM discretion). The monk must attack with a head-butt to use this style strike.<br><br>Knockback Kick: The monk attempts to knock his foe back with a powerful kick. If the attack hits, the monk can attempt a free combat maneuver check against the foe (using the base attack bonus of the attack used to hit the foe). If the check is successful, the foe is knocked 10 feet directly away from the monk. This distance increases by 10 feet for every 5 by which the check exceeds the foe’s CMD, to a maximum distance equal to the monk’s fast movement bonus. This movement does not provoke an attack of opportunity. The foe stops moving if it strikes another creature, barrier, or otherwise solid object. The creature is not knocked prone by this movement. The monk must attack with a kick to use this style strike.<br><br>Leg Sweep: The monk attempts to sweep his foe’s leg, knocking the opponent down. If the attack hits, the monk can make a free trip attempt against the target of this strike (using the base attack bonus of the attack used to hit the foe). This trip attempt does not provoke an attack of opportunity. The monk must attack with a kick to use this style strike.<br><br>Shattering Punch: The monk delivers a brutal punch that can penetrate defenses. If the attack hits, it bypasses any damage reduction or hardness possessed by the target of that attack. The monk must attack with a fist to use this style strike.<br><br>Spin Kick: The monk spins about, delivering a kick his foe did not expect. The monk makes his attack against the foe’s flat-footed AC. Creatures with the uncanny dodge class feature or a similar effect cannot be caught flat-footed by this style strike. The monk must attack with a kick to use this style strike.<br>","index":false},{"name":"Monkey Style","note":"","index":905},{"name":"Improved Unarmed Strike","note":"","index":758},{"name":"Dodge","note":"","index":361},{"name":"dispatchment","note":"At 4th level, whenever a ninja attacks an opponent that would be denied a Dexterity bonus to AC or when she flanks her target, she gains a +2 bonus on her attack roll. At 9th level and every 5 levels thereafter, this bonus increases by +1 (to a total maximum of +5).","index":false},{"name":"Combat Reflexes","note":"","index":203}],"notes":"Finesse training lvl 1 gives weapon finese<br><div>ninja trick for combat feat of two weapon fighting</div><div>Ninja trick for monkey style</div><div>lvl 1 feat feat to improved unarmed</div><div>lvl 3 feat Combat Reflex<br></div><div>lvl 5 feat dodge<br></div>"},"traits":{"all":[],"notes":""},"languages":{"all":[{"name":"Common","note":"","index":5},{"name":"Goblin","note":"","index":12}],"notes":""}},"equipment":{"possessions":{"gear":"","magic_gear":"","potion_viles_oils":"","scrolls":""},"armor":{"armor":"","check_penalty":"","max_dex":"","shield":""},"body_slots":{"belts":"","body":"","chest":"","eyes":"","feet":"","hands":"","head":"","headband":"","neck":"","ring_left_hand":"","ring_right_hand":"","shoulders":"","wrist":""},"item":{"all":[],"weight":{"current":0},"value":{"current":0}},"encumbrance":{"str":"","carry_move":{"light":"26 lbs. or less","medium":"27 - 53 lbs.","heavy":"54 - 80 lbs.","lift":"160 lbs.","drag":"400 lbs."}},"consumable":{"all":[]},"wealth":{"platinum":"","gold":"","silver":"","copper":"","total":0}},"defense":{"hp":{"total":32,"temp":"","damage":"","non_lethal_damage":"","current":32,"notes":""},"ac":{"armor_class":{"misc":"","temp":"","current":19,"bonuses":{"str":false,"dex":true,"con":false,"int":false,"wis":false,"cha":false,"plus_ten":true,"armor":true,"shield":true,"deflect":true,"dodge":true,"natural":true,"size_base":true,"max_dex":true}},"flat_footed":{"misc":"","temp":"","current":12,"bonuses":{"str":false,"dex":false,"con":false,"int":false,"wis":false,"cha":false,"plus_ten":true,"armor":true,"shield":true,"deflect":true,"natural":true,"size_base":true,"dodge":false}},"touch":{"misc":"","temp":"","current":18,"bonuses":{"str":false,"dex":true,"con":false,"int":false,"wis":false,"cha":false,"plus_ten":true,"deflect":true,"dodge":true,"size_base":true,"max_dex":true,"armor":false,"shield":false,"natural":false}},"stats":{"armor":1,"shield":"","deflect":"","dodge":1,"natural":""},"notes":"1 from feat dodge<br>"},"cmd":{"misc":"","temp":"","current":17,"notes":"","bonuses":{"str":true,"dex":true,"con":false,"int":false,"wis":false,"cha":false,"bab":true,"size_special":true,"level":false,"half_level":false,"plus_ten":true}},"saves":{"fortitude":{"base":1,"resistance":"","feat":"","trait":"","misc":"","temp":"","current":2,"bonuses":{"str":false,"dex":false,"con":true,"int":false,"wis":false,"cha":false,"level":false,"half_level":false}},"reflex":{"base":4,"resistance":"","feat":"","trait":"","misc":"","temp":"","current":10,"bonuses":{"str":false,"dex":true,"con":false,"int":false,"wis":false,"cha":false,"level":false,"half_level":false}},"will":{"base":1,"resistance":"","feat":"","trait":"","misc":"","temp":"","current":0,"bonuses":{"str":false,"dex":false,"con":false,"int":false,"wis":true,"cha":false,"level":false,"half_level":false}},"notes":""},"dr":{"feat":"","trait":"","misc":"","temp":"","overcome":"","current":0,"notes":"","bonuses":{"str":false,"dex":false,"con":false,"int":false,"wis":false,"cha":false,"level":false,"half_level":false}},"sr":{"feat":"","trait":"","misc":"","temp":"","current":0,"notes":"","bonuses":{"str":false,"dex":false,"con":false,"int":false,"wis":false,"cha":false,"level":false,"half_level":false}},"resistance":{"feat":"","trait":"","misc":"","temp":"","current":0,"notes":"","bonuses":{"str":false,"dex":false,"con":false,"int":false,"wis":false,"cha":false,"level":false,"half_level":false}}},"offense":{"stats":{"base_attack":{"bonus":3,"string":"+3"},"melee":{"misc":-2,"temp":"","current":8,"bonuses":{"str":false,"dex":true,"con":false,"int":false,"wis":false,"cha":false,"bab":true,"size_base":true,"level":false,"half_level":false}},"ranged":{"misc":"","temp":"","current":10,"bonuses":{"str":false,"dex":true,"con":false,"int":false,"wis":false,"cha":false,"bab":true,"size_base":true,"level":false,"half_level":false}}},"cmb":{"misc":"","temp":"","current":1,"notes":"","bonuses":{"str":true,"dex":false,"con":false,"int":false,"wis":false,"cha":false,"bab":true,"size_special":true,"level":false,"half_level":false}},"attack":{"notes":"<div>&gt;&gt;&gt;&gt;&gt; sneak attack 1d6 + 1d6 * lvl/2<br></div><div>The ninja’s attack deals extra damage anytime her target would be denied a Dexterity bonus to AC (whether the target actually has a Dexterity bonus or not), or when the ninja flanks her target. <br></div><div>&gt;&gt;&gt;&gt; Racial<br></div><div>Add a =lvl bonus on the rogue’s sneak attack damage rolls during the surprise round or before the target has acted in combat.</div><div>&gt;&gt;&gt;&gt; TWF</div><div>-2 to melee attack for 2 weapon fighting</div><div>&gt;&gt;&gt;&gt; Dispatchment</div><div>When target is denied dex to AC bonus add +2 to attack<br></div>","melee":{"all":[{"weapon":"Wakizashi","attack":"","damage":"1d4 + dex mod + lvl (see txt)","critical":"18-20/x2","type":"light weapon","equipped":true},{"weapon":"Wakizashi","attack":"","damage":"1d4 + dex mod + lvl (see txt)","critical":"18-20/x2","type":"light weapon","equipped":true}]},"ranged":{"all":[]}}},"skills":{"ranks":{"total":13,"include_custom":false,"current":45},"custom":{"all":[{"name":"Ki Pool","ranks":"","misc":"","racial":"","feat":"","trait":"","bonuses":{"str":false,"dex":false,"con":false,"int":false,"wis":false,"cha":true,"class_skill":false,"level":false,"half_level":true,"check_penalty":false,"size_modifier_stealth":false,"size_modifier_fly":false,"size_stealth":false,"size_fly":false},"current":2}]},"default":{"acrobatics":{"ranks":5,"misc":"","racial":4,"feat":4,"trait":"","current":21,"bonuses":{"str":false,"dex":true,"con":false,"int":false,"wis":true,"cha":false,"class_skill":true,"level":false,"half_level":false,"check_penalty":true}},"appraise":{"ranks":"","misc":"","racial":"","feat":"","trait":"","current":1,"bonuses":{"str":false,"dex":false,"con":false,"int":true,"wis":false,"cha":false,"class_skill":true,"level":false,"half_level":false,"check_penalty":false}},"bluff":{"ranks":5,"misc":"","racial":"","feat":"","trait":"","current":8,"bonuses":{"str":false,"dex":false,"con":false,"int":false,"wis":false,"cha":true,"class_skill":true,"level":false,"half_level":false,"check_penalty":false}},"climb":{"ranks":5,"misc":"","racial":4,"feat":"","trait":"","current":11,"bonuses":{"str":true,"dex":false,"con":false,"int":false,"wis":false,"cha":false,"class_skill":true,"level":false,"half_level":false,"check_penalty":true}},"craft_1":{"variant_name":"","ranks":"","misc":"","racial":"","feat":"","trait":"","current":1,"bonuses":{"str":false,"dex":false,"con":false,"int":true,"wis":false,"cha":false,"class_skill":true,"level":false,"half_level":false,"check_penalty":false}},"craft_2":{"variant_name":"","ranks":"","misc":"","racial":"","feat":"","trait":"","current":1,"bonuses":{"str":false,"dex":false,"con":false,"int":true,"wis":false,"cha":false,"class_skill":false,"level":false,"half_level":false,"check_penalty":false}},"diplomacy":{"ranks":1,"misc":"","racial":"","feat":"","trait":"","current":4,"bonuses":{"str":false,"dex":false,"con":false,"int":false,"wis":false,"cha":true,"class_skill":true,"level":false,"half_level":false,"check_penalty":false}},"disable_device":{"ranks":1,"misc":"","racial":"","feat":"","trait":"","current":12,"bonuses":{"str":false,"dex":true,"con":false,"int":false,"wis":false,"cha":false,"class_skill":true,"level":false,"half_level":true,"check_penalty":true}},"disguise":{"ranks":4,"misc":"","racial":"","feat":2,"trait":"","current":9,"bonuses":{"str":false,"dex":false,"con":false,"int":false,"wis":false,"cha":true,"class_skill":true,"level":false,"half_level":false,"check_penalty":false}},"escape_artist":{"ranks":4,"misc":"","racial":"","feat":"","trait":"","current":13,"bonuses":{"str":false,"dex":true,"con":false,"int":false,"wis":false,"cha":false,"class_skill":true,"level":false,"half_level":false,"check_penalty":true}},"fly":{"ranks":1,"misc":"","racial":"","feat":"","trait":"","current":9,"bonuses":{"str":false,"dex":true,"con":false,"int":false,"wis":false,"cha":false,"class_skill":false,"level":false,"half_level":false,"check_penalty":true,"size_fly":true}},"handle_animal":{"ranks":"","misc":"","racial":"","feat":"","trait":"","current":0,"bonuses":{"str":false,"dex":false,"con":false,"int":false,"wis":false,"cha":true,"class_skill":false,"level":false,"half_level":false,"check_penalty":false}},"heal":{"ranks":"","misc":"","racial":"","feat":"","trait":"","current":-1,"bonuses":{"str":false,"dex":false,"con":false,"int":false,"wis":true,"cha":false,"class_skill":false,"level":false,"half_level":false,"check_penalty":false}},"intimidate":{"ranks":"","misc":"","racial":"","feat":"","trait":"","current":0,"bonuses":{"str":false,"dex":false,"con":false,"int":false,"wis":false,"cha":true,"class_skill":true,"level":false,"half_level":false,"check_penalty":false}},"knowledge_arcana":{"ranks":"","misc":"","racial":"","feat":"","trait":"","current":1,"bonuses":{"str":false,"dex":false,"con":false,"int":true,"wis":false,"cha":false,"class_skill":false,"level":false,"half_level":false,"check_penalty":false}},"knowledge_dungeoneering":{"ranks":"","misc":"","racial":"","feat":"","trait":"","current":1,"bonuses":{"str":false,"dex":false,"con":false,"int":true,"wis":false,"cha":false,"class_skill":false,"level":false,"half_level":false,"check_penalty":false}},"knowledge_engineering":{"ranks":"","misc":"","racial":"","feat":"","trait":"","current":1,"bonuses":{"str":false,"dex":false,"con":false,"int":true,"wis":false,"cha":false,"class_skill":false,"level":false,"half_level":false,"check_penalty":false}},"knowledge_geography":{"ranks":"","misc":"","racial":"","feat":"","trait":"","current":1,"bonuses":{"str":false,"dex":false,"con":false,"int":true,"wis":false,"cha":false,"class_skill":false,"level":false,"half_level":false,"check_penalty":false}},"knowledge_history":{"ranks":"","misc":"","racial":"","feat":"","trait":"","current":1,"bonuses":{"str":false,"dex":false,"con":false,"int":true,"wis":false,"cha":false,"class_skill":false,"level":false,"half_level":false,"check_penalty":false}},"knowledge_local":{"ranks":1,"misc":"","racial":"","feat":"","trait":"","current":5,"bonuses":{"str":false,"dex":false,"con":false,"int":true,"wis":false,"cha":false,"class_skill":true,"level":false,"half_level":false,"check_penalty":false}},"knowledge_nature":{"ranks":"","misc":"","racial":"","feat":"","trait":"","current":1,"bonuses":{"str":false,"dex":false,"con":false,"int":true,"wis":false,"cha":false,"class_skill":false,"level":false,"half_level":false,"check_penalty":false}},"knowledge_nobility":{"ranks":1,"misc":"","racial":"","feat":"","trait":"","current":5,"bonuses":{"str":false,"dex":false,"con":false,"int":true,"wis":false,"cha":false,"class_skill":true,"level":false,"half_level":false,"check_penalty":false}},"knowledge_planes":{"ranks":"","misc":"","racial":"","feat":"","trait":"","current":1,"bonuses":{"str":false,"dex":false,"con":false,"int":true,"wis":false,"cha":false,"class_skill":false,"level":false,"half_level":false,"check_penalty":false}},"knowledge_religion":{"ranks":"","misc":"","racial":"","feat":"","trait":"","current":1,"bonuses":{"str":false,"dex":false,"con":false,"int":true,"wis":false,"cha":false,"class_skill":false,"level":false,"half_level":false,"check_penalty":false}},"linguistics":{"ranks":"","misc":"","racial":"","feat":"","trait":"","current":1,"bonuses":{"str":false,"dex":false,"con":false,"int":true,"wis":false,"cha":false,"class_skill":true,"level":false,"half_level":false,"check_penalty":false}},"perception":{"ranks":5,"misc":"","racial":"","feat":1,"trait":"","current":8,"bonuses":{"str":false,"dex":false,"con":false,"int":false,"wis":true,"cha":false,"class_skill":true,"level":false,"half_level":false,"check_penalty":false}},"perform_1":{"variant_name":"","ranks":"","misc":"","racial":"","feat":"","trait":"","current":0,"bonuses":{"str":false,"dex":false,"con":false,"int":false,"wis":false,"cha":true,"class_skill":true,"level":false,"half_level":false,"check_penalty":false}},"perform_2":{"variant_name":"","ranks":"","misc":"","racial":"","feat":"","trait":"","current":0,"bonuses":{"str":false,"dex":false,"con":false,"int":false,"wis":false,"cha":true,"class_skill":false,"level":false,"half_level":false,"check_penalty":false}},"profession_1":{"variant_name":"","ranks":"","misc":"","racial":"","feat":"","trait":"","current":-1,"bonuses":{"str":false,"dex":false,"con":false,"int":false,"wis":true,"cha":false,"class_skill":true,"level":false,"half_level":false,"check_penalty":false}},"profession_2":{"variant_name":"","ranks":"","misc":"","racial":"","feat":"","trait":"","current":-1,"bonuses":{"str":false,"dex":false,"con":false,"int":false,"wis":true,"cha":false,"class_skill":false,"level":false,"half_level":false,"check_penalty":false}},"ride":{"ranks":"","misc":"","racial":"","feat":"","trait":"","current":6,"bonuses":{"str":false,"dex":true,"con":false,"int":false,"wis":false,"cha":false,"class_skill":false,"level":false,"half_level":false,"check_penalty":true}},"sense_motive":{"ranks":"","misc":"","racial":"","feat":"","trait":"","current":-1,"bonuses":{"str":false,"dex":false,"con":false,"int":false,"wis":true,"cha":false,"class_skill":true,"level":false,"half_level":false,"check_penalty":false}},"sleight_of_hand":{"ranks":3,"misc":"","racial":"","feat":"","trait":"","current":12,"bonuses":{"str":false,"dex":true,"con":false,"int":false,"wis":false,"cha":false,"class_skill":true,"level":false,"half_level":false,"check_penalty":true}},"spellcraft":{"ranks":"","misc":"","racial":"","feat":"","trait":"","current":1,"bonuses":{"str":false,"dex":false,"con":false,"int":true,"wis":false,"cha":false,"class_skill":false,"level":false,"half_level":false,"check_penalty":false}},"stealth":{"ranks":5,"misc":"","racial":4,"feat":2,"trait":"","current":24,"bonuses":{"str":false,"dex":true,"con":false,"int":false,"wis":false,"cha":false,"class_skill":true,"level":false,"half_level":false,"check_penalty":true,"size_stealth":true}},"survival":{"ranks":"","misc":"","racial":"","feat":"","trait":"","current":-1,"bonuses":{"str":false,"dex":false,"con":false,"int":false,"wis":true,"cha":false,"class_skill":false,"level":false,"half_level":false,"check_penalty":false}},"swim":{"ranks":2,"misc":"","racial":"","feat":"","trait":"","current":4,"bonuses":{"str":true,"dex":false,"con":false,"int":false,"wis":false,"cha":false,"class_skill":true,"level":false,"half_level":false,"check_penalty":true}},"use_magic_device":{"ranks":2,"misc":"","racial":"","feat":"","trait":"","current":5,"bonuses":{"str":false,"dex":false,"con":false,"int":false,"wis":false,"cha":true,"class_skill":true,"level":false,"half_level":false,"check_penalty":false}}},"stats":{"notes":"stealth&amp;disguise from no trace feat<br>"}},"spells":{"stats":{"concentration":{"misc":"","temp":"","racial":"","feat":"","trait":"","current":0,"bonuses":{"str":false,"dex":false,"con":false,"int":false,"wis":false,"cha":false,"level":false,"half_level":false}},"caster_level_check":{"misc":"","temp":"","racial":"","feat":"","trait":"","current":0,"bonuses":{"str":false,"dex":false,"con":false,"int":false,"wis":false,"cha":false,"level":false,"half_level":false}},"school":"","opposition":"","domains":"","bloodline":"","notes":""},"book":{"level_0":{"per_day":"","known":"","bonus":"","dc":{"spell_level":0,"misc":"","temp":"","feat":"","trait":"","current":0,"bonuses":{"str":false,"dex":false,"con":false,"int":false,"wis":false,"cha":false,"level":false,"half_level":false,"spell_level":false,"plus_ten":false}},"all":[]},"level_1":{"per_day":"","known":"","bonus":"","dc":{"spell_level":1,"misc":"","temp":"","feat":"","trait":"","current":0,"bonuses":{"str":false,"dex":false,"con":false,"int":false,"wis":false,"cha":false,"level":false,"half_level":false,"spell_level":false,"plus_ten":false}},"all":[]},"level_2":{"per_day":"","known":"","bonus":"","dc":{"spell_level":2,"misc":"","temp":"","feat":"","trait":"","current":0,"bonuses":{"str":false,"dex":false,"con":false,"int":false,"wis":false,"cha":false,"level":false,"half_level":false,"spell_level":false,"plus_ten":false}},"all":[]},"level_3":{"per_day":"","known":"","bonus":"","dc":{"spell_level":3,"misc":"","temp":"","feat":"","trait":"","current":0,"bonuses":{"str":false,"dex":false,"con":false,"int":false,"wis":false,"cha":false,"level":false,"half_level":false,"spell_level":false,"plus_ten":false}},"all":[]},"level_4":{"per_day":"","known":"","bonus":"","dc":{"spell_level":4,"misc":"","temp":"","feat":"","trait":"","current":0,"bonuses":{"str":false,"dex":false,"con":false,"int":false,"wis":false,"cha":false,"level":false,"half_level":false,"spell_level":false,"plus_ten":false}},"all":[]},"level_5":{"per_day":"","known":"","bonus":"","dc":{"spell_level":5,"misc":"","temp":"","feat":"","trait":"","current":0,"bonuses":{"str":false,"dex":false,"con":false,"int":false,"wis":false,"cha":false,"level":false,"half_level":false,"spell_level":false,"plus_ten":false}},"all":[]},"level_6":{"per_day":"","known":"","bonus":"","dc":{"spell_level":6,"misc":"","temp":"","feat":"","trait":"","current":0,"bonuses":{"str":false,"dex":false,"con":false,"int":false,"wis":false,"cha":false,"level":false,"half_level":false,"spell_level":false,"plus_ten":false}},"all":[]},"level_7":{"per_day":"","known":"","bonus":"","dc":{"spell_level":7,"misc":"","temp":"","feat":"","trait":"","current":0,"bonuses":{"str":false,"dex":false,"con":false,"int":false,"wis":false,"cha":false,"level":false,"half_level":false,"spell_level":false,"plus_ten":false}},"all":[]},"level_8":{"per_day":"","known":"","bonus":"","dc":{"spell_level":8,"misc":"","temp":"","feat":"","trait":"","current":0,"bonuses":{"str":false,"dex":false,"con":false,"int":false,"wis":false,"cha":false,"level":false,"half_level":false,"spell_level":false,"plus_ten":false}},"all":[]},"level_9":{"per_day":"","known":"","bonus":"","dc":{"spell_level":9,"misc":"","temp":"","feat":"","trait":"","current":0,"bonuses":{"str":false,"dex":false,"con":false,"int":false,"wis":false,"cha":false,"level":false,"half_level":false,"spell_level":false,"plus_ten":false}},"all":[]}}},"notes":{"character":{"all":[{"note":"<div>ATTACKING</div><div>&gt; Sneak in, try to get sneak attack</div><div>&gt; once this is done, attack / try to flank<br>&gt; Full round attack (2 melee hits) + ki point for another attack (style def[+4 AC if lands] or spin kick[flat footed ie sneak attack]). So main hand, ki, off hand</div><div>&gt; try feinting (SA DC 10+wis+BAB or 10+sensmot, whichever against my bluff) which forces next attack to be flat footed (sneak attack)<br></div><div>&gt; if hit, go backwards (or away from people). Monkey style to stand as swift action (no AoO).&nbsp;</div><div><br></div><div>&lt;&gt;&lt;&gt;&lt;&gt;&lt;&gt;&lt;&gt;&lt;&gt;&lt;&gt;&lt;&gt;&lt;&gt;&lt;&gt;&lt;&gt;&lt;&gt;&lt;&gt;&lt;&gt;&lt;&gt;&lt;&gt;&lt;&gt;&lt;&gt;&lt;&gt;&lt;&gt;&lt;&gt;&lt;&gt;&lt;&gt;&lt;&gt;&lt;&gt;<br>Ninja are proficient with all simple weapons, plus the kama, katana, kusarigama, nunchaku, sai, shortbow, short sword, shuriken, siangham, and wakizashi. Ninjas are proficient with light armor but not with shields.</div><div><br></div><div>vvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvv</div><div>next feat take spring attack<br></div>"}]},"story":{"all":[]}},"events":{"all":[{"type":"xp","event":{"aggregate_value":6000},"timestamp":{"date":18,"day":3,"year":2018,"hours":0,"milliseconds":379,"minutes":18,"month":6,"seconds":3}},{"type":"xp","event":{"aggregate_value":9000},"timestamp":{"date":10,"day":0,"year":2018,"hours":5,"milliseconds":887,"minutes":53,"month":5,"seconds":27}}]}}